performance/results/location-search/20260812-164413-mysql-bounding-box-geo-keyword/warmup.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/accommodation-location-search.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 35s max duration (incl. graceful stop):
              * default: 1 looping VUs for 5s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  1.0s/5s

running (02.0s), 1/1 VUs, 59 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  2.0s/5s

running (03.0s), 1/1 VUs, 89 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  3.0s/5s

running (04.0s), 1/1 VUs, 119 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  4.0s/5s

running (05.0s), 1/1 VUs, 149 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  5.0s/5s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 750     149.787212/s
    checks_succeeded...: 100.00% 750 out of 750
    checks_failed......: 0.00%   0 out of 750

    ✓ HTTP 상태가 200이다
    ✓ success 값이 true이다
    ✓ data 값이 배열이다
    ✓ data 개수가 limit을 초과하지 않는다
    ✓ 검색 결과가 거리순으로 정렬되어 있다

    HTTP
    http_req_duration..............: avg=32.85ms min=26.77ms med=32.7ms  p(90)=34.41ms p(95)=35.48ms p(99)=37.85ms max=68.51ms
      { expected_response:true }...: avg=32.85ms min=26.77ms med=32.7ms  p(90)=34.41ms p(95)=35.48ms p(99)=37.85ms max=68.51ms
    http_req_failed................: 0.00%  0 out of 150
    http_reqs......................: 150    29.957442/s

    EXECUTION
    iteration_duration.............: avg=33.36ms min=26.92ms med=33.12ms p(90)=34.9ms  p(95)=35.91ms p(99)=38.22ms max=76.81ms
    iterations.....................: 150    29.957442/s
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 639 kB 128 kB/s
    data_sent......................: 27 kB  5.4 kB/s



running (05.0s), 0/1 VUs, 150 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  5s